blog/2010/10/10/how-to-remove-www-from-your-url-with-mod_rewrite/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>How to remove www from your URL with mod_rewrite - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="q" value="site:guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>How to remove www from your URL with mod_rewrite</h1>
  <p>
source link: <a href="http://yoast.com/how-to-remove-www-from-your-url-with-mod_rewrite/"><a href="http://yoast.com/how-to-remove-www-from-your-url-with-mod\_rewrite/">http://yoast.com/how-to-remove-www-from-your-url-with-mod\_rewrite/</a></a>
I got a hit today for the following search query: how do you get rid of the www in url .
</p>

<p>
Here's the code to 301 redirect the www version of your site to the non-www version using Apache's mod\_rewrite:
</p>


<pre class="example">
RewriteEngine On
RewriteCond %{HTTP_HOST} ^www.example.com$ [NC]
RewriteRule ^(.*)$ http://example.com/$1 [R=301,L]
</pre>




<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Adding the www instead of removing it</h2>
<div class="outline-text-2" id="text-1">
<p>
And, as requested in the comments, the code to add www to your domain name:
</p>


<pre class="example">
RewriteEngine On
RewriteCond %{HTTP_HOST} ^example.com$
RewriteRule (.*) http://www.example.com$1 [R=301]
</pre>
</div>
</div>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
